jmeter-tests/jmeter.log
2026-05-05 20:05:45,415 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-05-05 20:05:45,444 INFO o.a.j.JMeter: Loading user properties from: C:\Apache\JMeter\bin\user.properties
2026-05-05 20:05:45,445 INFO o.a.j.JMeter: Loading system properties from: C:\Apache\JMeter\bin\system.properties
2026-05-05 20:05:45,445 INFO o.a.j.JMeter: Setting JMeter property: host=localhost
2026-05-05 20:05:45,446 INFO o.a.j.JMeter: Setting JMeter property: port=8080
2026-05-05 20:05:45,446 WARN o.a.j.JMeter: Removing JMeter property: contextPath
2026-05-05 20:05:45,454 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-05-05 20:05:45,454 INFO o.a.j.JMeter: Version 5.6.3
2026-05-05 20:05:45,454 INFO o.a.j.JMeter: java.version=17.0.18
2026-05-05 20:05:45,454 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-05-05 20:05:45,454 INFO o.a.j.JMeter: os.name=Windows 11
2026-05-05 20:05:45,454 INFO o.a.j.JMeter: os.arch=amd64
2026-05-05 20:05:45,455 INFO o.a.j.JMeter: os.version=10.0
2026-05-05 20:05:45,455 INFO o.a.j.JMeter: file.encoding=Cp1251
2026-05-05 20:05:45,455 INFO o.a.j.JMeter: java.awt.headless=true
2026-05-05 20:05:45,455 INFO o.a.j.JMeter: Max memory     =1073741824
2026-05-05 20:05:45,455 INFO o.a.j.JMeter: Available Processors =8
2026-05-05 20:05:45,466 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-05-05 20:05:45,467 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-05-05 20:05:45,467 INFO o.a.j.JMeter: JMeterHome=C:\Apache\JMeter
2026-05-05 20:05:45,468 INFO o.a.j.JMeter: user.dir  =C:\Users\Julfy\Desktop\Учёба\Лабораторные Работы\6 Семестр\РПС\re-center\lab4\jmeter-tests
2026-05-05 20:05:45,468 INFO o.a.j.JMeter: PWD       =C:\Users\Julfy\Desktop\Учёба\Лабораторные Работы\6 Семестр\РПС\re-center\lab4\jmeter-tests
2026-05-05 20:05:55,407 INFO o.a.j.JMeter: IP: 192.168.0.100 Name: DESKTOP-CHGIGO0 FullName: 192.168.0.100
2026-05-05 20:05:55,430 INFO o.a.j.s.FileServer: Default base='C:\Users\Julfy\Desktop\Учёба\Лабораторные Работы\6 Семестр\РПС\re-center\lab4\jmeter-tests'
2026-05-05 20:05:55,432 INFO o.a.j.s.FileServer: Set new base='C:\Users\Julfy\Desktop\Учёба\Лабораторные Работы\6 Семестр\РПС\re-center\lab4\jmeter-tests'
2026-05-05 20:05:55,718 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-05-05 20:05:55,754 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-05-05 20:05:55,757 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-05-05 20:05:55,761 INFO o.a.j.s.SaveService: Loading file: C:\Users\Julfy\Desktop\Учёба\Лабораторные Работы\6 Семестр\РПС\re-center\lab4\jmeter-tests\recenter-lab4-booking.jmx
2026-05-05 20:05:55,860 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-05 20:05:55,860 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-05 20:05:55,860 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-05 20:05:55,860 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-05 20:05:55,860 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-05-05 20:05:55,860 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-05-05 20:05:55,944 INFO o.a.j.JMeter: Creating summariser <summary>
2026-05-05 20:05:55,959 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-05-05 20:05:55,960 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-05 20:05:55,960 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-05 20:05:55,965 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-05-05 20:05:55,966 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-05-05 20:05:56,260 INFO o.a.j.JMeter: Running test (1778000756260)
2026-05-05 20:05:56,275 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 5 Booking Users
2026-05-05 20:05:56,275 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group 5 Booking Users.
2026-05-05 20:05:56,275 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-05-05 20:05:56,275 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=30 delayedStart=false
2026-05-05 20:05:56,287 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-05-05 20:05:56,288 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-05-05 20:05:56,295 INFO o.a.j.t.JMeterThread: Thread started: 5 Booking Users 1-1
2026-05-05 20:05:56,299 INFO o.a.j.s.FileServer: Stored: lab4-users.csv
2026-05-05 20:05:59,488 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = DESKTOP-CHGIGO0
2026-05-05 20:05:59,495 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-05-05 20:05:59,497 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-05-05 20:05:59,498 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-05-05 20:05:59,498 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-05-05 20:05:59,498 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-05-05 20:06:01,809 INFO o.a.j.r.Summariser: summary +      2 in 00:00:06 =    0.4/s Avg:    85 Min:     3 Max:   167 Err:     2 (100.00%) Active: 1 Started: 1 Finished: 0
2026-05-05 20:06:02,289 INFO o.a.j.t.JMeterThread: Thread started: 5 Booking Users 1-2
2026-05-05 20:06:08,294 INFO o.a.j.t.JMeterThread: Thread started: 5 Booking Users 1-3
2026-05-05 20:06:14,288 INFO o.a.j.t.JMeterThread: Thread started: 5 Booking Users 1-4
2026-05-05 20:06:20,286 INFO o.a.j.t.JMeterThread: Thread started: 5 Booking Users 1-5
2026-05-05 20:06:30,105 INFO o.a.j.r.Summariser: summary +     48 in 00:00:28 =    1.7/s Avg:    20 Min:     2 Max:   121 Err:    34 (70.83%) Active: 5 Started: 5 Finished: 0
2026-05-05 20:06:30,106 INFO o.a.j.r.Summariser: summary =     50 in 00:00:34 =    1.5/s Avg:    22 Min:     2 Max:   167 Err:    36 (72.00%)
2026-05-05 20:07:00,532 INFO o.a.j.r.Summariser: summary +     75 in 00:00:30 =    2.5/s Avg:    18 Min:     2 Max:   156 Err:    59 (78.67%) Active: 5 Started: 5 Finished: 0
2026-05-05 20:07:00,533 INFO o.a.j.r.Summariser: summary =    125 in 00:01:04 =    1.9/s Avg:    19 Min:     2 Max:   167 Err:    95 (76.00%)
2026-05-05 20:07:30,882 INFO o.a.j.r.Summariser: summary +     75 in 00:00:30 =    2.5/s Avg:    14 Min:     1 Max:   113 Err:    59 (78.67%) Active: 5 Started: 5 Finished: 0
2026-05-05 20:07:30,883 INFO o.a.j.r.Summariser: summary =    200 in 00:01:35 =    2.1/s Avg:    17 Min:     1 Max:   167 Err:   154 (77.00%)
2026-05-05 20:08:01,156 INFO o.a.j.r.Summariser: summary +     75 in 00:00:30 =    2.5/s Avg:    14 Min:     1 Max:   118 Err:    57 (76.00%) Active: 5 Started: 5 Finished: 0
2026-05-05 20:08:01,157 INFO o.a.j.r.Summariser: summary =    275 in 00:02:05 =    2.2/s Avg:    17 Min:     1 Max:   167 Err:   211 (76.73%)
2026-05-05 20:08:30,020 INFO o.a.j.r.Summariser: summary +     73 in 00:00:29 =    2.5/s Avg:    14 Min:     2 Max:   112 Err:    58 (79.45%) Active: 5 Started: 5 Finished: 0
2026-05-05 20:08:30,021 INFO o.a.j.r.Summariser: summary =    348 in 00:02:34 =    2.3/s Avg:    16 Min:     1 Max:   167 Err:   269 (77.30%)
2026-05-05 20:08:59,838 INFO o.a.j.t.JMeterThread: Thread is done: 5 Booking Users 1-1
2026-05-05 20:08:59,838 INFO o.a.j.t.JMeterThread: Thread finished: 5 Booking Users 1-1
2026-05-05 20:09:00,288 INFO o.a.j.r.Summariser: summary +     73 in 00:00:30 =    2.4/s Avg:    13 Min:     1 Max:   112 Err:    57 (78.08%) Active: 4 Started: 5 Finished: 1
2026-05-05 20:09:00,288 INFO o.a.j.r.Summariser: summary =    421 in 00:03:04 =    2.3/s Avg:    16 Min:     1 Max:   167 Err:   326 (77.43%)
2026-05-05 20:09:04,467 INFO o.a.j.t.JMeterThread: Thread is done: 5 Booking Users 1-2
2026-05-05 20:09:04,467 INFO o.a.j.t.JMeterThread: Thread finished: 5 Booking Users 1-2
2026-05-05 20:09:10,451 INFO o.a.j.t.JMeterThread: Thread is done: 5 Booking Users 1-3
2026-05-05 20:09:10,451 INFO o.a.j.t.JMeterThread: Thread finished: 5 Booking Users 1-3
2026-05-05 20:09:16,471 INFO o.a.j.t.JMeterThread: Thread is done: 5 Booking Users 1-4
2026-05-05 20:09:16,471 INFO o.a.j.t.JMeterThread: Thread finished: 5 Booking Users 1-4
2026-05-05 20:09:22,512 INFO o.a.j.t.JMeterThread: Thread is done: 5 Booking Users 1-5
2026-05-05 20:09:22,512 INFO o.a.j.t.JMeterThread: Thread finished: 5 Booking Users 1-5
2026-05-05 20:09:22,513 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-05-05 20:09:22,513 INFO o.a.j.s.FileServer: Close: lab4-users.csv
2026-05-05 20:09:22,517 INFO o.a.j.r.Summariser: summary +     29 in 00:00:22 =    1.3/s Avg:     9 Min:     1 Max:   110 Err:    24 (82.76%) Active: 0 Started: 5 Finished: 5
2026-05-05 20:09:22,518 INFO o.a.j.r.Summariser: summary =    450 in 00:03:26 =    2.2/s Avg:    15 Min:     1 Max:   167 Err:   350 (77.78%)